fn main() {
    fn1();
}

/// str 和 \[i32\] 类型的变量无法在编译器确定确定大小，会出现编译错误
fn fn1() {
    //类型不匹配；s1 的大小在编译时不能确定
    //let s1: str = "hello";
    //解决方法：使用 &str 类型，因为它是一个指针，大小是确定的
    let _s2: &str = "hi";

    // [i32] 的大小在编译时不能确定
    //    let arr0: [i32] = [1, 2, 3];
    //解决方法：
    let _arr1: [i32; 3] = [7, 8, 9];
    let _arr2: &[i32] = &[1, 2, 3];
    let _arr3: &[i32; 3] = &[1, 2, 3];

    let v1: Vec<i32> = vec![4, 5, 6];
    // v1[..] 的类型是 [i32]，大小在编译器无法确定
    //let x1: [i32] = v1[..];
    //解决
    let _x2: &[i32] = &v1[..];
}
